app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "New Title"], ["description", "Test Posty"], ["created_at", "2019-11-02 03:15:36.644931"], ["updated_at", "2019-11-02 03:15:36.644931"], ["author_id", 3]]
---
  def create
    @post = Post.new(post_params)
    @post.save